data/google/compute-engine/cpu/256/node-121/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     5948.10
    fsyncs/s:                     7623.16

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               92.94

General statistics:
    total time:                          10.0028s
    total number of events:              135628

Latency (ms):
         min:                                    0.01
         avg:                                    0.07
         max:                                   42.48
         95th percentile:                        0.04
         sum:                                 9972.80

Threads fairness:
    events (avg/stddev):           135628.0000/0.00
    execution time (avg/stddev):   9.9728/0.00